//n封信对应n个信封
//求恰好全部装错了信封的方案数

#include<cstdio>
typedef long long LL;
int n;
LL dp[25];
void init(){
    dp[1] = 0;
    dp[2] = 1;
    for(int i = 3; i <= 20; i ++){
        dp[i] = (i-1) * (dp[i-1] + dp[i-2]);
    }
}
int main(){
    init();
    while(~scanf("%d", &n)){
        printf("%I64d\n", dp[n]);
    }
}




//私货
//给n盆花涂色，从m种颜色中选取k种颜色涂，保证正好用上k种颜色，你必须用上这k种颜色去涂满n个相邻的花，并且要求相邻花的颜色不同，求方案数。
//C(m,k) * ( k * (k-1)^(n-1) + [∑((-1)^i * C(k, k - i) * (k-i) * (k-i-1)^(n-1)) ] )    (1 <= i <= k-1)
//（这里m有1e9，C(m, k)直接用for循环算，直接for循环从m*(m-1)*...*(m-k+1)再乘k的阶乘的逆元）



//私货2
//题意：就是让你求(a,b)区间与n互质的数的个数.
//我们可以先求(1~b)区间的答案，然后减去(1~a-1)区间的答案
//这样问题就转换为(1~m)区间与n互质的数的个数
//互质的不好求，我们可以求不互质的个数，然后减一下
//所有我们先求出n的所有质因数，然后用容斥做